title: Google Workspace - Password change
status: production
id: 76fa7767-2470-4063-8213-c0cbd6c1a02c
description: Detects when a password is changed on user account.
date: 2024/03/01
modified: 2024/03/01
author: OWN-CERT
references:
    - https://developers.google.com/admin-sdk/reports/v1/appendix/activity/user-accounts
tags:
    - attack.persistence
logsource:
    product: google_workspace
    service: google_workspace.user_accounts
level: medium
detection:
    selection:
        eventName:
            - password_edit 
    condition: selection
falsepositives:
    - Legitimate password rotation by the user
