title: Google Workspace - Suspicious connection
status: production
id: 10b65e0f-08d5-4f99-8302-a8f1b2d986d5
description: Detects when a suspicious connection is detected.
date: 2024/03/01
modified: 2024/03/01
author: OWN-CERT
references:
    - https://developers.google.com/admin-sdk/reports/v1/appendix/activity/login
tags:
    - attack.credential_access
logsource:
    product: google_workspace
    service: google_workspace.login
level: medium
detection:
    selection:
        eventName:
            - suspicious_login
            - suspicious_login_less_secure_app
            - suspicious_programmatic_login
            - user_signed_out_due_to_suspicious_session_cookie
            - account_disabled_generic
            - account_disabled_spamming_through_relay
            - account_disabled_spamming
            - account_disabled_hijacked
            - gov_attack_warning
            - blocked_sender
    condition: selection
falsepositives:
    - User connection behavior
